# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "humbug/box"
tap "codekitchen/dinghy"
tap "drud/ddev"
tap "garfieldius/t3ll"


# Binaries (dockerized)

#whalebrew "whalebrew/ansible"
#whalebrew "whalebrew/youtube-dl"
#whalebrew "whalebrew/ab"
#whalebrew "whalebrew/shellcheck"

# Binaries (common)
brew "whalebrew" # https://github.com/whalebrew/whalebrew
brew "mas" # command line interface for the Mac App Store. Designed for scripting and automation.
brew "ack" # Replacement for 99% of the uses of grep
brew "coreutils" # Those that come with macOS are outdated @TODO: make coreutils available in PATH
brew "ffmpeg"
brew "svn"
brew "par2"
cask "xquartz" # dependency for diff-pdf
brew "unrar"
brew "asciinema" # Record your terminal
#brew "autojump" # Older alternative to fasd and other alternative to z.sh
brew "gh" # Official GitHub CLI
brew "wget"
brew "pygments"
brew "multitail" # Like tail for multiple log files
brew "tcpdump"
brew "ngrep" # Network packet analyzer
brew "grep"
brew "base64"
brew "bat" # Clone of cat with syntax hightlighting and Git entegration
brew "broot" # New way to see and navigate directory trees
brew "brotli"
brew "bzip2"
brew "libdvdcss"
brew "libcroco"
brew "librsvg"
brew "ccat" # Like cat but displays content with syntax highlighting (The alias is probably overriden by oh-my-zsh when using https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/colorize)
brew "cheat" # Like tldr but configurable for own environment and community driven cheatsheets @TODO: implement cheat community cheatsheets
brew "cmake"
brew "colordiff" # Like diff but color-highlighted
brew "curl"
brew "curl-openssl"
brew "dav1d" # AV1 video decoder
brew "ddrescue" # GNU data recovery tool
brew "diff-pdf"
brew "diff-so-fancy" # better git diff tool @TODO: https://github.com/so-fancy/diff-so-fancy#usage
brew "dinghy"
#brew "docbook"
#brew "docbook-xsl"
#brew "docker"
#brew "docker-compose"
brew "docker-ls" # CLI for browsing and manipulating docker registries
brew "docker-machine" # Create Docker hosts locally and on cloud providers
brew "docker-machine-parallels"
brew "editorconfig"
brew "emacs"
brew "exiftool"
brew "faac" # freeware aac audio encoder
brew "fdk-aac" # Standalone library of the Fraunhofer FDK AAC code from endroid
brew "findutils" # Collection of GNU find, xargs, and locate
brew "flac"
brew "frei0r" # Minimalistic plugin API for video effects
brew "fribidi"
brew "fzf" # Command-line fuzzy finder written in Go
brew "gawk"
brew "gcc"
brew "gd"
brew "gettext"
brew "ghostscript"
brew "giflib"
brew "gifsicle"
brew "git"
brew "git-cal"
brew "git-extras"
#brew "git-flow"
brew "git-delta"
brew "git-gerrit"
brew "git-plus"
#brew "git-recent" # also part of git-plus
#brew "git-standup" # also part of git-extras
brew "git-lfs"
brew "git-quick-stats"
brew "git-review" # Gerrit tools
brew "github-release"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg2"
brew "gnutls"
brew "go"
brew "googler"
brew "graphicsmagick"
#brew "graphviz" # @TODO: Docker based execution of graphviz
brew "gzip"
brew "htop"
brew "iftop"
brew "ipcalc"
brew "iperf3"
brew "mackup"
brew "pkg-config"
brew "trash"
brew "jq"
brew "lame"
brew "nativefier" # command-line tool to easily create a desktop app for any web site
brew "ncdu" # disk usage analyzer with an ncurses interface
brew "neovim"
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "nmap"
brew "osx-cpu-temp" # Show CPU temp and fan speed
brew "prettyping"
brew "pigz" # Parallel gzip (speed up and used by oh-my-zsh plugin extract)
brew "pstree"
brew "qrencode" # base for one of my Alfred workflows
brew "rsync"
brew "screen"
brew "speedtest-cli"
brew "screenfetch" # shows distribution shell welcome message like MOTD
brew "thefuck" # correct errors in previous console commands with fuck
brew "tmux"
brew "tor"
brew "torsocks"
brew "translate-shell"
brew "tree"
brew "watch"
brew "watchman" # Watch files and take action when they change
brew "whatmask"
brew "youtube-dl"
brew "readline"
brew "todolist"
brew "unfs3"
brew "xz" # (used by oh-my-zsh plugin extract)
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh.
brew "zsh-history-substring-search"
brew "zsh-lovers"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "automake"

# Unnecessary funny
brew "sl" # Prints a steam locomotive if you type sl instead of ls
brew "asciiquarium"
brew "catimg"
brew "cmatrix"
brew "cowsay"
brew "figlet" # Banner-like program prints strings as ASCII art
brew "fortune"
brew "lolcat" # rainbow colored cat command

# System
cask "onyx" # Free system maintainance GUI

# Development
brew "aha"
brew "awscli"
brew "brew-php-switcher"
brew "sqlmap"
brew "sqlite"
brew "tcpflow"
brew "tcptrace"
brew "bfg" # Remove large files or passwords from Git history like git-filter-branch
brew "hashpump" # Tool to exploit hash length extension attack
brew "box" # Fast, zero config application bundler with PHARs
brew "composer"
brew "binwalk" # Searches a binary image for embedded files and executable code
brew "ddev"
brew "john" # Featureful UNIX password cracker
brew "nvm"
brew "knock" # check knocking on open ports
#brew "freetds" # MSSQL libs to talk to MS SQL Servers and sybase DBs
brew "hcloud" # Hetzner cloud
brew "highlight" # Convert source code to formatted text with syntax eighlighting
brew "httpie"
brew "httrack"
brew "icdiff"
brew "rename"
brew "imagemagick"
brew "imageoptim-cli"
brew "jpegoptim"
brew "optipng"
brew "svgo"
brew "make"
brew "mkcert"
brew "node"
brew "nodenv" # node version manager https://github.com/nodenv/nodenv
brew "ios-sim" # Command-line application launcher for the iOS Simulator https://github.com/ios-control/ios-sim
brew "mysql"
brew "pandoc"
brew "php@7.4"
brew "php@7.2"
brew "php@7.3"
brew "php-code-sniffer"
brew "php-cs-fixer"
brew "phpmd"
brew "pngcrush"
brew "pngquant"
brew "nghttp2"
brew "pwgen"
brew "pyenv"
brew "rbenv" # Ruby version manager
brew "selenium-server-standalone"
brew "shellcheck"
brew "shfmt" # A shell parser, formatter, and interpreter. https://github.com/mvdan/sh (@TODO: shfmt supports pre-commit project)
brew "siege"
brew "ssh-copy-id"
brew "ssllabs-scan"
brew "sslscan"
brew "sslyze"
brew "swaks" # SMTP test tool https://www.jetmore.org/john/code/swaks/
brew "garfieldius/t3ll/t3ll" # TYPO3 XLF file editing tool
#brew "telnet"
brew "testssl"
cask "textexpander" # #productivity #license-needed #subscription-needed
brew "the_silver_searcher"
brew "rg" # ripgrep: Search tool like grep and The Silver Searcher
brew "tig"
brew "tldr"
brew "ultralist" # ToDo list on CLI
brew "yarn"
brew "webp"
brew "xmlto"

# Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "calibre"
cask "chromedriver"
cask "chromium"
#cask "carbon-copy-cloner"
cask "dash"
cask "iterm2-beta"
cask "screens-connect"
cask "dbngin" # UI for running local databases in macOS
cask "discord"
cask "day-o"
cask "devdocs" # Like dash but free
cask "dropbox"
cask "docker" # Docker Desktop / for Mac
cask "elgato-control-center"
cask "elgato-game-capture-hd"
cask "fing-cli"
cask "firefox"
cask "firefox-developer-edition"
cask "fontforge"
cask "github" # GitHub Desktop app
cask "go64" # Check for 32/64bit apps on your macOS system
cask "google-chrome"
cask "handbrake"
cask "gpg-suite" # (licenense needed)
cask "imagealpha" # UI based image compressing tool (pngquant)
cask "jetbrains-toolbox"
cask "jasper" # GitHub issue reader GUI
cask "ksdiff" # Kaleidoscope helper because I've purchased it via App Store
#cask "little-snitch" # personal firewall (license needed)
cask "macdown" # free markdown UI editor
cask "macpar-deluxe" # repair tool for rar archives (for my photo archives)
cask "mark-text" # free markdown UI editor (advanced)
cask "mkvtoolnix"
cask "mkvtools"
cask "nordvpn"
#cask "onedrive" # Microsoft OneDrive
cask "paw" # API tool for Mac (license needed)
cask "pennywise"
cask "prepros" # FE pipeline compiler (redmine abacus theme related) #projectspecific
cask "responsively" # Multiple browser viewports to test RWD
cask "rightfont" # (license needed)
cask "safari-technology-preview"
cask "sequel-pro" # #dev #dev-database
cask "sequel-ace" # community driven "successor" of sequel-pro
cask "signal"
#cask "sketch" # (license needed)
cask "skype"
cask "slack"
cask "sonos"
cask "spotify"
cask "teamviewer"
cask "tower"
cask "transmit" # (license needed)
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vnc-viewer"
cask "whatsize" # (license needed)
#cask "wireshark"



# Quicklook
#cask "qlcolorcode" # quicklook plugin deactivated due to missing developer cert on Catalina (maybe https://github.com/sbarex/SourceCodeSyntaxHighlight is an alternative)
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
#cask "qlstephen" # quicklook plugin deactivated due to missing developer cert on Catalina

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store (Account a*@*.com)
mas "Airmail 4", id: 918858936
mas "Cardhop", id: 1290358394
mas "ColorSnapper2", id: 969418666
mas "Divvy", id: 413857545
mas "Fantastical", id: 975937182
mas "FiveNotes", id: 1231597027
mas "Flexiglass", id: 426410278
mas "Home Inventory", id: 413564952
mas "iA Writer", id: 775737590
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LogTail", id: 1073404370
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Patterns", id: 429449079
mas "Screens 4", id: 1224268771
mas "SMTP Test", id: 791001975
mas "SnippetsLab", id: 1006087419
mas "The Archive Browser", id: 510232205
mas "Versatil Markdown", id: 997373210
mas "WhatsApp", id: 1147396723
mas "xScope", id: 889428659
mas "PLIST Editor", id: 1157491961
